---
kind: property
id: P:Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.Visible
source: html/7987fe72-d5b1-a6d2-9dce-29f2dba65170.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudOverrideSettings.Visible Property

Visibility flag for point cloud scans.

## Syntax (C#)
```csharp
public bool Visible { get; set; }
```

## Remarks
This flag is used only for visibility of point cloud scans
 because the visibility of the whole point cloud element is managed as for other elements hidden in the view.